package org.example.popkov;
//1 уровень сложности: 1 Создайте класс Траншея. У траншеи есть целевая
// длина и текущая длина. Создайте класс Землекоп, объекты которого копают
// траншею (увеличивают текущую длину), пока не будет достигнута целевая длина.
// Каждый землекоп может прокопать 1 м траншеи, а затем он отдыхает 10 секунд.
// В программе создайте траншею и двух землекопов. Измерьте, за какое время
// траншею прокопает один землекоп и за какое время с такой же траншеей управятся двое.

//2 Напишите программу, которая вычисляет какую-либо сложную функцию для каждого
// целого числа от 1 до N, N – входной параметр (большое число, например, 10 000 000)
// N – ввод с консоли. Результат выводится на экран. Поскольку N – большое,
// необходимо разбить вычисления на несколько частей и каждую часть вычислить
// в отдельном потоке параллельно. Для каждой части нужно создать объект Task,
// внутри которого запомнить данные для начала вычислений, а так же сохранить
// результат после завершения вычислений. Каждый поток работает со своим объектом Task.

// Примеры функций см. в презентации в дискорд.
public class Main {
    public static void main(String[] args) {

        System.out.println("Hello world!");
    }
}